{
    "nodes": [
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "The causes of secession were complex and have been controversial since the war began, but most academic scholars identify slavery as a central cause of the war. James C. Bradford wrote that the issue has been further complicated by historical revisionists, who have tried to offer a variety of reasons for the war.[24] Slavery was the central source of escalating political tension in the 1850s. The Republican Party was determined to prevent any spread of slavery, and many Southern leaders had threatened secession if the Republican candidate, Lincoln, won the 1860 election. After Lincoln won, many Southern leaders felt that disunion was their only option, fearing that the loss of representation would hamper their ability to promote pro-slavery acts and policies.[25][26]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          "id": "",
          "object": "youtube",
          "src": "4Zavtvct-8U",
          "tags": [
            
          ]
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": ""
          }
        ],
        "object": "block",
        "type": "youtube"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Slavery"
          }
        ],
        "object": "block",
        "type": "heading-three"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Slavery was a major cause of disunion.[27] Although there were opposing views even in the Union States,[28][29] most northern soldiers were mostly indifferent on the subject of slavery,[30] while Confederates fought the war mainly to protect a southern society of which slavery was an integral part.[31][32] From the anti-slavery perspective, the issue was primarily about whether the system of slavery was an anachronistic evil that was incompatible with republicanism. The strategy of the anti-slavery forces was containment—to stop the expansion and thus put slavery on a path to gradual extinction.[33] The slave-holding interests in the South denounced this strategy as infringing upon their Constitutional rights.[34] Southern whites believed that the emancipation of slaves would destroy the South's economy, due to the large amount of capital invested in slaves and fears of integrating the ex-slave black population.[35] In particular, Southerners feared a repeat of \"the horrors of Santo Domingo\", in which nearly all white people – including men, women, children, and even many sympathetic to abolition – were killed after the successful slave revolt in Haiti. Historian Thomas Fleming points to the historical phrase \"a disease in the public mind\" used by critics of this idea, and proposes it contributed to the segregation in the Jim Crow era following emancipation.[36] These fears were exacerbated by the recent attempt of John Brown to instigate an armed slave rebellion in the South."
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Slavery was illegal in much of the North, having been outlawed in the late 18th and early 19th centuries. It was also fading in the border states and in Southern cities, but it was expanding in the highly profitable cotton districts of the rural South and Southwest. Subsequent writers on the American Civil War looked to several factors explaining the geographic divide.[citation needed]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Territorial crisis"
          }
        ],
        "object": "block",
        "type": "heading-three"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Between 1803 and 1854, the United States achieved a vast expansion of territory through purchase, negotiation, and conquest. At first, the new states carved out of these territories entering the union were apportioned equally between slave and free states. Pro- and anti-slavery forces collided over the territories west of the Mississippi.[37]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "With the conquest of northern Mexico west to California in 1848, slaveholding interests looked forward to expanding into these lands and perhaps Cuba and Central America as well.[38][39] Northern \"free soil\" interests vigorously sought to curtail any further expansion of slave territory. The Compromise of 1850 over California balanced a free-soil state with stronger fugitive slave laws for a political settlement after four years of strife in the 1840s. But the states admitted following California were all free: Minnesota (1858), Oregon (1859) and Kansas (1861). In the Southern states the question of the territorial expansion of slavery westward again became explosive.[40] Both the South and the North drew the same conclusion: \"The power to decide the question of slavery for the territories was the power to determine the future of slavery itself.\"[41][42]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "By 1860, four doctrines had emerged to answer the question of federal control in the territories, and they all claimed they were sanctioned by the Constitution, implicitly or explicitly.[43] The first of these \"conservative\" theories, represented by the Constitutional Union Party, argued that the Missouri Compromise apportionment of territory north for free soil and south for slavery should become a Constitutional mandate. The Crittenden Compromise of 1860 was an expression of this view.[44]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "The second doctrine of Congressional preeminence, championed by Abraham Lincoln and the Republican Party, insisted that the Constitution did not bind legislators to a policy of balance—that slavery could be excluded in a territory as it was done in the Northwest Ordinance of 1787 at the discretion of Congress;[45] thus Congress could restrict human bondage, but never establish it. The Wilmot Proviso announced this position in 1846.[46]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Senator Stephen A. Douglas proclaimed the doctrine of territorial or \"popular\" sovereignty—which asserted that the settlers in a territory had the same rights as states in the Union to establish or disestablish slavery as a purely local matter.[47] The Kansas–Nebraska Act of 1854 legislated this doctrine.[48] In the Kansas Territory, years of pro and anti-slavery violence and political conflict erupted; the congressional House of Representatives voted to admit Kansas as a free state in early 1860, but its admission in the Senate was delayed until January 1861, after the 1860 elections when Southern states began to leave.[49]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "The fourth theory was advocated by Mississippi Senator Jefferson Davis,[50] one of state sovereignty (\"states' rights\"),[51] also known as the \"Calhoun doctrine\",[52] named after the South Carolinian political theorist and statesman John C. Calhoun.[53] Rejecting the arguments for federal authority or self-government, state sovereignty would empower states to promote the expansion of slavery as part of the federal union under the U.S. Constitution.[54] \"States' rights\" was an ideology formulated and applied as a means of advancing slave state interests through federal authority.[55] As historian Thomas L. Krannawitter points out, the \"Southern demand for federal slave protection represented a demand for an unprecedented expansion of federal power.\"[56][57] These four doctrines comprised the dominant ideologies presented to the American public on the matters of slavery, the territories, and the U.S. Constitution before the 1860 presidential election.[58]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "States' rights"
          }
        ],
        "object": "block",
        "type": "heading-three"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "The South argued that just as each state had decided to join the Union, a state had the right to secede—leave the Union—at any time. Northerners (including President Buchanan) rejected that notion as opposed to the will of the Founding Fathers, who said they were setting up a perpetual union.[59] Historian James McPherson writes concerning states' rights and other non-slavery explanations:"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "While one or more of these interpretations remain popular among the Sons of Confederate Veterans and other Southern heritage groups, few professional historians now subscribe to them. Of all these interpretations, the states'-rights argument is perhaps the weakest. It fails to ask the question, states' rights for what purpose? States' rights, or sovereignty, was always more a means than an end, an instrument to achieve a certain goal more than a principle.[60]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Sectionalism"
          }
        ],
        "object": "block",
        "type": "heading-three"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Sectionalism resulted from the different economies, social structure, customs, and political values of the North and South.[61][62] Regional tensions came to a head during the War of 1812, resulting in the Hartford Convention, which manifested Northern dissastisfaction with a foreign trade embargo that affected the industrial North disproportionately, the Three-Fifths Compromise, dilution of Northern power by new states, and a succession of Southern presidents. Sectionalism increased steadily between 1800 and 1860 as the North, which phased slavery out of existence, industrialized, urbanized, and built prosperous farms, while the deep South concentrated on plantation agriculture based on slave labor, together with subsistence agriculture for poor whites. In the 1840s and 1850s, the issue of accepting slavery (in the guise of rejecting slave-owning bishops and missionaries) split the nation's largest religious denominations (the Methodist, Baptist, and Presbyterian churches) into separate Northern and Southern denominations.[63]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Historians have debated whether economic differences between the mainly industrial North and the mainly agricultural South helped cause the war. Most historians now disagree with the economic determinism of historian Charles A. Beard in the 1920s, and emphasize that Northern and Southern economies were largely complementary. While socially different, the sections economically benefited each other.[64][65]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Protectionism"
          }
        ],
        "object": "block",
        "type": "heading-three"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Slave owners preferred low-cost manual labor with no mechanization. Northern manufacturing interests supported tariffs and protectionism while southern planters demanded free trade.[66] The Democrats in Congress, controlled by Southerners, wrote the tariff laws in the 1830s, 1840s, and 1850s, and kept reducing rates so that the 1857 rates were the lowest since 1816. The Republicans called for an increase in tariffs in the 1860 election. The increases were only enacted in 1861 after Southerners resigned their seats in Congress.[67][68] The tariff issue was a Northern grievance. However, neo-Confederate writers have claimed it as a Southern grievance. In 1860–61 none of the groups that proposed compromises to head off secession raised the tariff issue.[69] Pamphleteers North and South rarely mentioned the tariff.[70]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Nationalism and honor"
          }
        ],
        "object": "block",
        "type": "heading-three"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Nationalism was a powerful force in the early 19th century, with famous spokesmen such as Andrew Jackson and Daniel Webster. While practically all Northerners supported the Union, Southerners were split between those loyal to the entire United States (called \"unionists\") and those loyal primarily to the southern region and then the Confederacy.[71] C. Vann Woodward said of the latter group,"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "A great slave society ... had grown up and miraculously flourished in the heart of a thoroughly bourgeois and partly puritanical republic. It had renounced its bourgeois origins and elaborated and painfully rationalized its institutional, legal, metaphysical, and religious defenses ... When the crisis came it chose to fight. It proved to be the death struggle of a society, which went down in ruins.[72]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Perceived insults to Southern collective honor included the enormous popularity of Uncle Tom's Cabin (1852)[73] and the actions of abolitionist John Brown in trying to incite a slave rebellion in 1859.[74]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "While the South moved towards a Southern nationalism, leaders in the North were also becoming more nationally minded, and they rejected any notion of splitting the Union. The Republican national electoral platform of 1860 warned that Republicans regarded disunion as treason and would not tolerate it: \"We denounce those threats of disunion ... as denying the vital principles of a free government, and as an avowal of contemplated treason, which it is the imperative duty of an indignant people sternly to rebuke and forever silence.\"[75] The South ignored the warnings: Southerners did not realize how ardently the North would fight to hold the Union together.[76]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "Lincoln's election"
          }
        ],
        "object": "block",
        "type": "heading-three"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "The election of Abraham Lincoln in November 1860 was the final trigger for secession.[77] Efforts at compromise, including the \"Corwin Amendment\" and the \"Crittenden Compromise\", failed. Southern leaders feared that Lincoln would stop the expansion of slavery and put it on a course toward extinction. The slave states, which had already become a minority in the House of Representatives, were now facing a future as a perpetual minority in the Senate and Electoral College against an increasingly powerful North. Before Lincoln took office in March 1861, seven slave states had declared their secession and joined to form the Confederacy."
          }
        ],
        "object": "block",
        "type": "paragraph"
      },
      {
        "data": {
          
        },
        "nodes": [
          {
            "marks": [
              
            ],
            "object": "text",
            "text": "According to Lincoln, the people had shown that they can be successful in establishing and administering a republic, but a third challenge faced the nation, maintaining a republic based on the people's vote against an attempt to overthrow it.[78]"
          }
        ],
        "object": "block",
        "type": "paragraph"
      }
    ]
  }